@Ankmat 

I am able to see route_advertisement enabled in bigip in the first run, when advertize_route=true in resource "bigip_ltm_virtual_address" .  what is the bigip version you are using and what is terraform-provider-bigip version ?

![image](https://user-images.githubusercontent.com/48274565/88919023-0f29bc00-d288-11ea-96ea-60c90838275d.png)



Below is the config i have tried

resource "bigip_ltm_pool" "pool" {
  name                = "/Common/terraform-pool"
  load_balancing_mode = "round-robin"
  allow_snat          = "yes"
  allow_nat           = "yes"
}
resource "bigip_ltm_virtual_server" "http" {
  pool                       = "/Common/terraform-pool"
  name                       = "/Common/terraform_vs_http"
  destination                = "100.1.1.100"
  port                       = 80
  source_address_translation = "automap"
  depends_on                 = [bigip_ltm_pool.pool]
}

resource "bigip_ltm_virtual_address" "vs_va" {
  name            = "/Common/1.1.1.1"
  advertize_route = true
  depends_on = [bigip_ltm_virtual_server.http, bigip_ltm_pool.pool]
}



HYD-ML-00064439:terraform-provider-bigip papineni$ terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # bigip_ltm_pool.pool will be created
  + resource "bigip_ltm_pool" "pool" {
      + allow_nat           = "yes"
      + allow_snat          = "yes"
      + id                  = (known after apply)
      + load_balancing_mode = "round-robin"
      + monitors            = (known after apply)
      + name                = "/Common/terraform-pool"
      + reselect_tries      = (known after apply)
      + service_down_action = (known after apply)
      + slow_ramp_time      = (known after apply)
    }

  # bigip_ltm_virtual_address.vs_va will be created
  + resource "bigip_ltm_virtual_address" "vs_va" {
      + advertize_route = true
      + arp             = true
      + auto_delete     = true
      + conn_limit      = 0
      + enabled         = true
      + icmp_echo       = true
      + id              = (known after apply)
      + name            = "/Common/1.1.1.1"
      + traffic_group   = "/Common/traffic-group-1"
    }

  # bigip_ltm_virtual_server.http will be created
  + resource "bigip_ltm_virtual_server" "http" {
      + client_profiles              = (known after apply)
      + destination                  = "100.1.1.100"
      + fallback_persistence_profile = (known after apply)
      + id                           = (known after apply)
      + ip_protocol                  = (known after apply)
      + mask                         = (known after apply)
      + name                         = "/Common/terraform_vs_http"
      + persistence_profiles         = (known after apply)
      + pool                         = "/Common/terraform-pool"
      + port                         = 80
      + profiles                     = (known after apply)
      + server_profiles              = (known after apply)
      + snatpool                     = (known after apply)
      + source                       = (known after apply)
      + source_address_translation   = "automap"
      + state                        = "enabled"
      + translate_address            = (known after apply)
      + translate_port               = (known after apply)
      + vlans_enabled                = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

bigip_ltm_pool.pool: Creating...
bigip_ltm_pool.pool: Creation complete after 2s [id=/Common/terraform-pool]
bigip_ltm_virtual_server.http: Creating...
bigip_ltm_virtual_server.http: Creation complete after 5s [id=/Common/terraform_vs_http]
bigip_ltm_virtual_address.vs_va: Creating...
bigip_ltm_virtual_address.vs_va: Creation complete after 1s [id=/Common/1.1.1.1]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.
HYD-ML-00064439:terraform-provider-bigip papineni$ terraform plan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

bigip_ltm_pool.pool: Refreshing state... [id=/Common/terraform-pool]
bigip_ltm_virtual_server.http: Refreshing state... [id=/Common/terraform_vs_http]
bigip_ltm_virtual_address.vs_va: Refreshing state... [id=/Common/1.1.1.1]

------------------------------------------------------------------------

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.
HYD-ML-00064439:terraform-provider-bigip papineni$ terraform apply
bigip_ltm_pool.pool: Refreshing state... [id=/Common/terraform-pool]
bigip_ltm_virtual_server.http: Refreshing state... [id=/Common/terraform_vs_http]
bigip_ltm_virtual_address.vs_va: Refreshing state... [id=/Common/1.1.1.1]

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.
HYD-ML-00064439:terraform-provider-bigip papineni$ 

